Tekla Open API Reference for Tekla Structures 2025
BaseWeld.FinishAbove Property
 Gets or sets the finish above.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public BaseWeld.WeldFinishEnum FinishAbove { get; set; }
Public Property FinishAbove As BaseWeld.WeldFinishEnum
	Get
	Set
Property Value
Type: BaseWeld.WeldFinishEnum
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace